import React, { Component } from 'react';
import 'bootstrap/dist/css/bootstrap.css';

import './Offer.css';

export class Offer extends Component {
    render() {
        return (
            <div>
                <div className="article__header">
                    <span className="article__header_text">Оферта</span>
                </div>

                <article className="article__body">
                    <section>

                        <div className="article__section_body">
                            <strong>1.1</strong> Все средства, пожертвованные в пользу Amigo Server считаются добровольными и возврату не подлежат. Все услуги, являются вознаграждением за безвозмездную помощь проекту.<br/>

                            <strong>1.2</strong> Управляющие Amigo Server не несут ответственности за проблемы с переводом средств, связанные с другими сайтами, платёжными системами, а также проблемы, возникшие со стороны и/или по вине пользователя, либо третьих лиц.<br/>

                            <strong>1.3</strong> В случае закрытия проекта/сервера, или передачи его другому владельцу, все привилегии аннулируются.<br/>

                            <strong>1.4</strong> В случае нарушения Заказчиком действующих правил, Amigo Server оставляет за собой право отказать в предоставлении привилегий без возврата средств за неиспользованные услуги.<br/>

                            <strong>1.5</strong> Управляющие Amigo Server могут аннулировать ваши привилегии без каких-либо причин.<br/>

                            <strong>1.6</strong> Используя данный ресурс, Пользователь выражает свое согласие с данным Лицензионным соглашением, а также обязуется придерживаться Правил пользования Ресурсом.<br/>

                            <strong>1.7</strong> Настоящее Пользовательское соглашение устанавливает правила использования интернет-ресурса Amigo Server, расположенного по адресу Amigoserver.xyz (в дальнейшем — Ресурс) и физическим лицом, зарегистрированным на Ресурсе в качестве пользователя (в дальнейшем — Пользователь).<br/>

                            <strong>1.8</strong> Используя данный Ресурс, Пользователь официально соглашается на хранение и обработку Ресурсом своих персональных данных как переданных в процессе регистрации, так и размещенных в процессе дальнейшего использования Ресурса. Ресурс гарантирует конфиденциальность персональных данных Пользователя в соответствии с законом России «Про защиту персональных данных»<br/>

                            <strong>1.9</strong> По желанию пользователь может прекратить хранение и обработку всех своих персональных данных путем написания письменного заявления на удаление профиля.<br/>

                            <strong>1.10</strong> Споры и претензии между Пользователем и другими участниками Ресурса (в том числе самим Ресурсом) разрешаются Ресурсом, если спорный вопрос входит в его компетенцию. При невозможности урегулирования внутри Ресурса спор подлежит разрешению в порядке, предусмотренном законами России.<br/>

                            <strong>1.11</strong> Все приобретённые привилегии привязаны к одному единственному SteamID Пользователя и не подлежат дальнейшему переносу.<br/>

                            <strong>1.12</strong> Настоящее Соглашение не является окончательным. Ресурс вправе внести в него изменения в соответствии с изменениями функциональности и/или практики использования Сервиса. Компания вправе в одностороннем порядке внести изменения в данное соглашение, оно будет считаться вступившим в силу при публикации обновления в сети Интернет.<br/>
                        </div>      
                    </section>
                </article>
            </div>

            
        );


    }
}